app/controllers/v1/channel_controller.rb

SELECT  `channels`.* FROM `channels` channel_types WHERE (channels.parent_id !='-1 ')  ORDER BY id DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `channels` WHERE (parent_id !='')
---
  def index
    if session[:username]
      @menu_title = "Channel List"
      @sidebar_left = "v1/templates/sidebar_left"
      @data_channel  = Channel.where("parent_id !='-1 '").page(params[:page]).per(Cms::Application.config.page_limit).order('id DESC')

SELECT `channels`.* FROM `channels` WHERE (parent_id = '0')  ORDER BY channel_name DESC
---
  def add
    if session[:username]
      @menu_title = "Add Channel"
      @sidebar_left = "v1/templates/sidebar_left"
      @data_parent  = Channel.where("parent_id = '0'").order('channel_name DESC')

INSERT INTO `channels` (`channel_name`, `parent_id`, `create_at`, `create_time_at`, `update_at`) VALUES ('Megapolitan', 1, '2015-09-06 00:12:00.000000', 1441475268, '2015-09-06 00:12:00.000000')
---
  def insert
    if session[:username]
      dateNow = Time.now.strftime("%Y-%m-%d %H:%I")
      timeNow = Time.now.to_i
      channel = Channel.new(channel_name: params[:channel_name], parent_id: params[:parent_id], create_at: dateNow, create_time_at: timeNow, update_at:dateNow, create_time_at: timeNow)
      @save = channel.save

SELECT  `channels`.* FROM `channels` WHERE `channels`.`id` = 1  ORDER BY `channels`.`id` ASC LIMIT 1 OFFSET 0
---
  def edit
    if session[:username]
      uri = request.original_url
      id = URI(uri).path.split('/')[3]
      @menu_title = "Edit Channel"
      @sidebar_left = "v1/templates/sidebar_left"
      @data_channel  = Channel.where(:id => id).first

SELECT  `channels`.* FROM `channels` WHERE `channels`.`id` = 1 LIMIT 1
UPDATE `channels` SET `channel_name` = NULL, `parent_id` = NULL, `update_at` = '2015-09-03 01:01:00.000000', `update_time_at` = 1441217478 WHERE `channels`.`id` = 1
---
  def update
    if session[:username]
      dateNow = Time.now.strftime("%Y-%m-%d %H:%I")
      timeNow = Time.now.to_i
      channel = Channel.find_by(id: params[:id])
      channel.channel_name = params[:channel_name]
      channel.parent_id = params[:parent_id]
      channel.update_at = dateNow