app/controllers/v1/channel_type_controller.rb

SELECT  `channel_types`.* FROM `channel_types` WHERE (parent_id !='-1 ')  ORDER BY id DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `channel_types`
---
  def index
    if session[:username]
      @menu_title = "Channel Type List"
      @sidebar_left = "v1/templates/sidebar_left"
      @data_channel_type  = ChannelType.page(params[:page]).per(10).order('id DESC')

INSERT INTO `channel_types` (`channel_type_name`, `create_at`, `update_at`) VALUES ('Content', '2015-09-07 16:04:00.000000', '2015-09-07 16:04:00.000000')
---
  def insert
    if session[:username]
      dateNow = Time.now.strftime("%Y-%m-%d %H:%I")
      channel_type = ChannelType.new(channel_type_name: params[:channel_type_name], create_at: dateNow, update_at: dateNow)
      @save = channel_type.save