app/controllers/v1/login_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'aroel_keren@yahoo.com' AND `users`.`password` = '8843d7f92416211de9ebb963ff4ce28125932878'  ORDER BY `users`.`id` ASC LIMIT 1
---
  def attempt_login

    #if session[:username].length > 0
    #  redirect_to :controller => 'home'
    #end

    if params[:email].present? && params[:password].present?
      found_user = User.where(:email => params[:email], :password => Digest::SHA1.hexdigest(params[:password])).first