app/controllers/v1/user_controller.rb

SELECT  `users`.* FROM `users`  ORDER BY id DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `users`
---
  def index
    #render :text => "hello world"
    if session[:username]
      @menu_title = "User List"
      @sidebar_left = "v1/templates/sidebar_left"
      @data_user  = User.page(params[:page]).per(Cms::Application.config.page_limit).order('id DESC')

INSERT INTO `users` (`username`, `email`, `firstname`, `lastname`, `password`, `created_at`) VALUES ('anyung', 'anyung@nyahoo.com', 'anyung', 'anying', 'd92c0b178054167aca85353136f0930f1609a6e5', '2015-08-16 17:43:53.283562')
---
  def insert
    if session[:username]
      user = User.new(username: params[:username], email: params[:email], firstname: params[:firstname], lastname: params[:lastname], password: Digest::SHA1.hexdigest(params[:username]))
      @save = user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 10  ORDER BY `users`.`id` ASC LIMIT 1 OFFSET 0
---
  def edit
    if session[:username]
      uri = request.original_url
      id = URI(uri).path.split('/')[3]
      @menu_title = "Edit User"
      @sidebar_left = "v1/templates/sidebar_left"
      @data_user  = User.where(:id => id).first

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
UPDATE `users` SET `username` = 'abi1', `email` = 'abi@nyahoo.com1', `firstname` = 'abi1', `lastname` = 'haqi1' WHERE `users`.`id` = 8
---
  def update
    if session[:username]
      #binding.pry
      user = User.find_by(id: params[:id])
      user.username = params[:username]
      user.email = params[:email]
      user.firstname = params[:firstname]
      user.lastname = params[:lastname]
      user.save