app/views/v1/channel/_list.html.erb

SELECT  `channels`.* FROM `channels` channel_types WHERE (channels.parent_id !='-1 ')  ORDER BY id DESC LIMIT 5 OFFSET 0
---
        <td>
          <% get_parent_name  = Channel.where(:id => data.parent_id).first%>